Revit 2022 API
StructuralSettings.AnalyticalModelSupportDistanceTolerance Property
 The maximum distance between two structural elements, where analytical model support rules still apply.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
Since: 2011
Syntax
C#
public double AnalyticalModelSupportDistanceTolerance { get; set; }
Visual Basic
Public Property AnalyticalModelSupportDistanceTolerance As Double
	Get
	Set
Visual C++
public:
property double AnalyticalModelSupportDistanceTolerance {
	double get ();
	void set (double value);
}
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.DisabledDisciplineException |  When setting this property: None of the following disciplines is enabled: Structural.
See Also
StructuralSettings Class
Autodesk.Revit.DB.Structure Namespace